Revit 2027 API
BuiltInFailures.SketchFailures.TrussCrossingReferences Property
 Truss top and bottom references cannot cross.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussCrossingReferences { get; }
Public Shared ReadOnly Property TrussCrossingReferences As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussCrossingReferences {
	FailureDefinitionId^ get ();
}
static member TrussCrossingReferences : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace